# Occupation data

In [1]:
# importing libraries

import pandas as pd
import numpy as np

In [2]:
# load dataset

df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|',index_col = "user_id")
df.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [3]:
# number of observation

df.shape

(943, 4)

In [4]:
# all column name

df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [5]:
# how dataframe indexes
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [6]:
# data type of each column

df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [7]:
# how many different occupations are in this dataset?

df.occupation.nunique()

21

In [8]:
# what is the most frequent occupation?

df.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [9]:
# Summarize the dataframe

df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [10]:
# Summarize all the columns

df.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [13]:
# Summarize only the occupation column

df.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [11]:
# what is the mean age of users?

df.age.mean()

34.05196182396607

In [12]:
# what is the age with least occurrence?

df.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [20]:
df.values[2][2]

'writer'